eboxmaker/eBox_Framework/mcuLib/N32G030/n32g030_std_periph_driver/inc/n32g030_rtc.h
/** @addtogroup RTC_WeekDay_Definitions
 * @{
 */

#define RTC_WEEKDAY_MONDAY    ((uint8_t)0x01)
#define RTC_WEEKDAY_TUESDAY   ((uint8_t)0x02)
#define RTC_WEEKDAY_WEDNESDAY ((uint8_t)0x03)
#define RTC_WEEKDAY_THURSDAY  ((uint8_t)0x04)
#define RTC_WEEKDAY_FRIDAY    ((uint8_t)0x05)
#define RTC_WEEKDAY_SATURDAY  ((uint8_t)0x06)
#define RTC_WEEKDAY_SUNDAY    ((uint8_t)0x07)
#define IS_RTC_WEEKDAY(WEEKDAY)                                                                                        \
    (((WEEKDAY) == RTC_WEEKDAY_MONDAY) || ((WEEKDAY) == RTC_WEEKDAY_TUESDAY) || ((WEEKDAY) == RTC_WEEKDAY_WEDNESDAY)   \
     || ((WEEKDAY) == RTC_WEEKDAY_THURSDAY) || ((WEEKDAY) == RTC_WEEKDAY_FRIDAY)                                       \
     || ((WEEKDAY) == RTC_WEEKDAY_SATURDAY) || ((WEEKDAY) == RTC_WEEKDAY_SUNDAY))
/**
 * @}
 */

/** @addtogroup RTC_Alarm_Definitions
 * @{
 */
#define IS_RTC_ALARM_WEEKDAY_DATE(DATE) (((DATE) > 0) && ((DATE) <= 31))
#define IS_RTC_ALARM_WEEKDAY_WEEKDAY(WEEKDAY)                                                                          \
    (((WEEKDAY) == RTC_WEEKDAY_MONDAY) || ((WEEKDAY) == RTC_WEEKDAY_TUESDAY) || ((WEEKDAY) == RTC_WEEKDAY_WEDNESDAY)   \
     || ((WEEKDAY) == RTC_WEEKDAY_THURSDAY) || ((WEEKDAY) == RTC_WEEKDAY_FRIDAY)                                       \
     || ((WEEKDAY) == RTC_WEEKDAY_SATURDAY) || ((WEEKDAY) == RTC_WEEKDAY_SUNDAY))

/**
 * @}
 */

/** @addtogroup RTC_AlarmDateWeekDay_Definitions
 * @{
 */
#define RTC_ALARM_SEL_WEEKDAY_DATE    ((uint32_t)0x00000000)
#define RTC_ALARM_SEL_WEEKDAY_WEEKDAY ((uint32_t)0x40000000)

#define IS_RTC_ALARM_WEEKDAY_SEL(SEL)                                                                                  \
    (((SEL) == RTC_ALARM_SEL_WEEKDAY_DATE) || ((SEL) == RTC_ALARM_SEL_WEEKDAY_WEEKDAY))

/**
 * @}
 */

/** @addtogroup RTC_AlarmMask_Definitions
 * @{
 */
#define RTC_ALARMMASK_NONE    ((uint32_t)0x00000000)
#define RTC_ALARMMASK_WEEKDAY ((uint32_t)0x80000000)
#define RTC_ALARMMASK_HOURS   ((uint32_t)0x00800000)
#define RTC_ALARMMASK_MINUTES ((uint32_t)0x00008000)
#define RTC_ALARMMASK_SECONDS ((uint32_t)0x00000080)
#define RTC_ALARMMASK_ALL     ((uint32_t)0x80808080)
#define IS_ALARM_MASK(INTEN)  (((INTEN)&0x7F7F7F7F) == (uint32_t)RESET)

/**
 * @}
 */

/** @addtogroup RTC_Alarms_Definitions
 * @{
 */
#define RTC_A_ALARM                ((uint32_t)0x00000100)
#define RTC_B_ALARM                ((uint32_t)0x00000200)
#define IS_RTC_ALARM_SEL(ALARM)    (((ALARM) == RTC_A_ALARM) || ((ALARM) == RTC_B_ALARM))
#define IS_RTC_ALARM_ENABLE(ALARM) (((ALARM) & (RTC_A_ALARM | RTC_B_ALARM)) != (uint32_t)RESET)

/**
 * @}
 */

/** @addtogroup RTC_Alarm_Sub_Seconds_Masks_Definitions
 * @{
 */
#define RTC_SUBS_MASK_ALL                                                                                              \
    ((uint32_t)0x00000000) /*!< All Alarm SS fields are masked.                                                        \
                                         There is no comparison on sub seconds                                         \
                                         for Alarm */
#define RTC_SUBS_MASK_SS14_1                                                                                           \
    ((uint32_t)0x01000000) /*!< SS[14:1] are don't care in Alarm                                                       \
                                         comparison. Only SS[0] is compared. */
#define RTC_SUBS_MASK_SS14_2                                                                                           \
    ((uint32_t)0x02000000) /*!< SS[14:2] are don't care in Alarm                                                       \
                                         comparison. Only SS[1:0] are compared */
#define RTC_SUBS_MASK_SS14_3                                                                                           \
    ((uint32_t)0x03000000) /*!< SS[14:3] are don't care in Alarm                                                       \
                                         comparison. Only SS[2:0] are compared */
#define RTC_SUBS_MASK_SS14_4                                                                                           \
    ((uint32_t)0x04000000) /*!< SS[14:4] are don't care in Alarm                                                       \
                                         comparison. Only SS[3:0] are compared */
#define RTC_SUBS_MASK_SS14_5                                                                                           \
    ((uint32_t)0x05000000) /*!< SS[14:5] are don't care in Alarm                                                       \
                                         comparison. Only SS[4:0] are compared */
#define RTC_SUBS_MASK_SS14_6                                                                                           \
    ((uint32_t)0x06000000) /*!< SS[14:6] are don't care in Alarm                                                       \
                                         comparison. Only SS[5:0] are compared */
#define RTC_SUBS_MASK_SS14_7                                                                                           \
    ((uint32_t)0x07000000) /*!< SS[14:7] are don't care in Alarm                                                       \
                                         comparison. Only SS[6:0] are compared */
#define RTC_SUBS_MASK_SS14_8                                                                                           \
    ((uint32_t)0x08000000) /*!< SS[14:8] are don't care in Alarm                                                       \
                                         comparison. Only SS[7:0] are compared */
#define RTC_SUBS_MASK_SS14_9                                                                                           \
    ((uint32_t)0x09000000) /*!< SS[14:9] are don't care in Alarm                                                       \
                                         comparison. Only SS[8:0] are compared */
#define RTC_SUBS_MASK_SS14_10                                                                                          \
    ((uint32_t)0x0A000000) /*!< SS[14:10] are don't care in Alarm                                                      \
                                         comparison. Only SS[9:0] are compared */
#define RTC_SUBS_MASK_SS14_11                                                                                          \
    ((uint32_t)0x0B000000) /*!< SS[14:11] are don't care in Alarm                                                      \
                                         comparison. Only SS[10:0] are compared */
#define RTC_SUBS_MASK_SS14_12                                                                                          \
    ((uint32_t)0x0C000000) /*!< SS[14:12] are don't care in Alarm                                                      \
                                         comparison.Only SS[11:0] are compared */
#define RTC_SUBS_MASK_SS14_13                                                                                          \
    ((uint32_t)0x0D000000) /*!< SS[14:13] are don't care in Alarm                                                      \
                                         comparison. Only SS[12:0] are compared */
#define RTC_SUBS_MASK_SS14_14                                                                                          \
    ((uint32_t)0x0E000000) /*!< SS[14] is don't care in Alarm                                                          \
                                      comparison.Only SS[13:0] are compared */
#define RTC_SUBS_MASK_NONE                                                                                             \
    ((uint32_t)0x0F000000) /*!< SS[14:0] are compared and must match                                                   \
                                         to activate alarm. */
#define IS_RTC_ALARM_SUB_SECOND_MASK_MODE(INTEN)                                                                       \
    (((INTEN) == RTC_SUBS_MASK_ALL) || ((INTEN) == RTC_SUBS_MASK_SS14_1) || ((INTEN) == RTC_SUBS_MASK_SS14_2)          \
     || ((INTEN) == RTC_SUBS_MASK_SS14_3) || ((INTEN) == RTC_SUBS_MASK_SS14_4) || ((INTEN) == RTC_SUBS_MASK_SS14_5)    \
     || ((INTEN) == RTC_SUBS_MASK_SS14_6) || ((INTEN) == RTC_SUBS_MASK_SS14_7) || ((INTEN) == RTC_SUBS_MASK_SS14_8)    \
     || ((INTEN) == RTC_SUBS_MASK_SS14_9) || ((INTEN) == RTC_SUBS_MASK_SS14_10) || ((INTEN) == RTC_SUBS_MASK_SS14_11)  \
     || ((INTEN) == RTC_SUBS_MASK_SS14_12) || ((INTEN) == RTC_SUBS_MASK_SS14_13) || ((INTEN) == RTC_SUBS_MASK_SS14_14) \
     || ((INTEN) == RTC_SUBS_MASK_NONE))
/**
 * @}
 */

/** @addtogroup RTC_Alarm_Sub_Seconds_Value
 * @{
 */

